Fases<br>
<br>
O jogo &eacute; composto de seis fases ao todo, ou seja, cinco aposentos mais o por&atilde;o. A seguir, temos uma descri&ccedil;&atilde;o do jogo em cada uma das fases.<br>
<br>
- Jardim<br>
<br>
Nessa fase, Fofia ir&aacute; enfrentar um grupo de moscas normais que sobrevoam o jardim de entrada de sua casa seguindo um padr&atilde;o determinado. S&atilde;o 3 fileiras de 5 moscas em cada. S&atilde;o 3 p&atilde;es de prote&ccedil;&atilde;o. As moscas descem bem devagar.<br>
<br>
- Sala de Estar<br>
<br>
Nessa fase, Fofia ir&aacute; enfrentar outro grupo de moscas normais, s&oacute; que aqui, elas n&atilde;o seguem um padr&atilde;o de movimenta&ccedil;&atilde;o igual &agrave; fase anterior e elas descem um pouco mais r&aacute;pidas. S&atilde;o 15 moscas de novo. O n&uacute;mero de p&atilde;es de prote&ccedil;&atilde;o continua o mesmo.<br>
<br>
- Sala de TV<br>
<br>
Nessa fase, Fofia ir&aacute; enfrentar um grupo de moscas varejeiras mais fortes e mais velozes que as normais. As varejeiras nessa fase, ainda seguem um padr&atilde;o de movimenta&ccedil;&atilde;o. Por&eacute;m, elas descem mais r&aacute;pidas e a quantidade de baba &eacute; maior. S&atilde;o 15 moscas varejeiras. O n&uacute;mero de p&atilde;es cai para dois.<br>
<br>
- Quarto<br>
<br>
Nessa fase, Fofia ir&aacute; enfrentar um grupo de moscas varejeiras que j&aacute; n&atilde;o seguem um padr&atilde;o t&atilde;o formal quanto o da fase anterior. As moscas est&atilde;o mais r&aacute;pidas, por&eacute;m continuam na quantidade de 15. O n&uacute;mero de p&atilde;es ainda &eacute; dois tamb&eacute;m.<br>
<br>
- Cozinha<br>
<br>
Na cozinha, Fofia enfrenta moscas dos dois tipos: normais e varejeiras. Elas est&atilde;o em n&uacute;mero de 20 aqui e s&atilde;o bem velozes, descem de maneira r&aacute;pida e atiram muita baba durante a fase. O n&uacute;mero de p&atilde;es &eacute; dois.<br>
<br>
- Por&atilde;o<br>
<br>
No por&atilde;o, existe a enorme mosca Mosc&atilde;o, o chefe da gangue. O Mosc&atilde;o de tempos em tempos chama moscas guarda-costas e fica se lan&ccedil;ando pr&oacute;ximo a Fofia para tentar depositar baba super t&oacute;xica em sua roupa. Ap&oacute;s matar o Mosc&atilde;o, Fofia encontra o Serginho e a anima&ccedil;&atilde;o final entra em cena. N&atilde;o existe p&atilde;o de prote&ccedil;&atilde;o nessa &uacute;ltima fase.<br>
<br>
